mermaid added to README
